import React from "react";

const History = () => {
  return (
    <div className="w-full p-10 flex flex-col justify-center items-center">
      <h1 className="text-6xl special-font">电协历史</h1>

      <div className="mt-2 shadow-xl  w-full rounded-xl p-5 bg-gray-50">
        <div className="flex flex-row gap-3">
          <p className="bg-[#FF5B5B] h-4 w-4 rounded-full shadow-md"></p>
          <p className="bg-[#FFBD2E] h-4 w-4 rounded-full shadow-md"></p>
          <p className="bg-[#2AC73A] h-4 w-4 rounded-full shadow-md"></p>
        </div>

        <div className="flex flex-col gap-5 p-20 text-xl leading-9">
          <p>
            {" "}
            为往后电脑逐渐普遍化做好充分的准备，校方于 1982
            年成立了电脑学会，由陈昌新、石锦才、郑淑娴三位导师担任顾问。在老师们的悉心指导及会员们的努力耕耘下，
            “电脑学会”诞生了！本原属辅导处管理之课外活动团体，后于 1984
            年脱离辅导处，成为电脑中心属下之学术性团体。到 1985
            年，电脑学会正式地改名为电脑协会成为了一个服务性学术团体。
          </p>
          <p>
            {" "}
            2014 年 8 月，
            高三会员设计并开发了宽艺网。宽艺网的目标是通过帮助各课外活动团体建立形象和分享创作，
            培养学生的创造力。2015 年， 本协会举办了第一届 Robocode
            机器人编程比赛。2016 年，电脑协会迎来了首批初中会员的加入，
            为协会注入了新朝气。除此之外，亦增加了Rero、Audio、电绘等学习组。3月，本协会主办了与吉隆坡中华独立中学的交流营。此外，协会也参加每两年一次的三协交流营，促进各团之间的感情。不仅如此，会所的墙壁也重新粉刷及设计，让会员们能够享受一个全新的环境。2015
            年，电脑中心改名为资讯处。2016 年，由资讯处与联课处共同管理。 到了
            2017
            年，电脑协会的目标为所有会员都必须会基本的编程和培养自学的能力并注入了电协双核精神，让会员们更加团结更有纪律。2018
            年，电脑协会会所也从宽友楼搬到福建会馆楼。
            同时，资讯资源处和电脑室都搬迁至新建的郭钦鉴楼，为会员提供新的环境学习。
          </p>
          <p>
            第 28
            届理事层当中增加了副财政、副总务、副文书、技术和查账这些职位，以肩负本协会的工作。
            并将各工作组组长职位增加至 2 位，心情职务则由康乐组接手。在第 38
            届理事层中，除了总务组，其余工作组组长删减至一人。在第 39
            届理事层中废除了技术职位，其工作由研教接手。在第 40
            届理事层中增加了查账职位。跨越二十一世纪，电脑协会不知不觉巳迈入第四十二个年头，
            希望电脑协会的每一份子在理事们英明的领导之下，能走向更光明、更美好的前途。
          </p>
          <p>
            {" "}
            受新冠肺炎疫情和行动管制令影响，本团于 2020 年 4 月22
            日第一次召开线上会员大会。2023年下半年，电协官网完成制作 :)
          </p>
        </div>
      </div>
    </div>
  );
};

export default History;
